app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: params[:username], password: params[:password])
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = '' AND `users`.`password` = '' LIMIT 1