app/controllers/users_controller.rb

  def index
   @users= User.page(params[:page] || 1).per_page(params[:per_page] || 10)
    .order("id desc")
---
SELECT  `users`.* FROM `users` ORDER BY id desc LIMIT 10 OFFSET 0

  def create
    @user =  User.new(params.require(:user).permit(:username,:password))
    if @user.save
---
INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES ('jason1', '123456', '2018-10-27 14:27:20', '2018-10-27 14:27:20')