app/views/layouts/application.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1  [["id", 5], ["LIMIT", 1]]
---
                      <% if session[:user_id] %>
                       <li><%= link_to "#{User.find(session[:user_id]).username}, 退出",sessions_path(session[:user_id]), method: 'delete' %></li>